Repository: SrdjanRuljic/UserNest
Catalog: src/Core/Application/Resources/Translation.*.resx
Languages: sl, sr_cyrl_rs, sr_latn_rs

# AtLeastOneRoleRequired
source: At least one role is required.
sl: Potrebna je vsaj ena vloga.
sr_cyrl_rs: Неопходна је најманје једна улога.
sr_latn_rs: Neophodna je najmanje jedna uloga.

# ConcurrencyFailure
source: Optimistic concurrency failure, object has been modified.
sl: Optimistična napaka sočasnosti, objekt je bil spremenjen.
sr_cyrl_rs: Оптимистички неуспјех паралелности, објекат је измјењен.
sr_latn_rs: Optimistički neuspjeh paralelnosti, objekt je izmijenjen.

# CurrentPasswordMustContain
source: A current password must contain uppercase and lowercase letters, numbers, and special characters.
sl: Trenutno geslo mora vsebovati velike in male črke, številke in posebne znake.
sr_cyrl_rs: Тренутна лозинка мора садржати велика и мала слова, бројеве и специјалне знакове.
sr_latn_rs: Trenutna lozinka mora sadržati velika i mala slova, brojeve i specijalne znakоve.

# CurrentRasswordRequired
source: Current password is required.
sl: Trenutno geslo je potrebno.
sr_cyrl_rs: Тренутна лозинка је неопходна.
sr_latn_rs: Trenutna lozinka je neophodna.

# DataNotFound
source: The requested data was not found.
sl: Zahtevani podatki niso bili najdeni.
sr_cyrl_rs: Тражени подаци нису пронађени.
sr_latn_rs: Traženi podaci nisu pronađeni.

# DefaultError
source: An unknown failure has occurred.
sl: Prišlo je do neznane napake.
sr_cyrl_rs: Дошло је до непознате грешке.
sr_latn_rs: Došlo je do nepoznate greške.

# DuplicateEmail
source: Email '{0}' is already taken.
sl: E-poštni naslov '{0}' je že zaseden.
sr_cyrl_rs: Мејл '{0}' је већ заузет.
sr_latn_rs: Mejl '{0}' je već zauzeta.

# DuplicateRoleName
source: Role name '{0}' is already taken.
sl: Ime vloge '{0}' je že zasedeno.
sr_cyrl_rs: Назив улоге '{0}' је већ заузет.
sr_latn_rs: Naziv uloge '{0}' je već zauzet.

# DuplicateUserName
source: User Name '{0}' is already taken.
sl: Uporabniško ime '{0}' je že zasedeno.
sr_cyrl_rs: Корисничко име '{0}' је већ заузето.
sr_latn_rs: Korisničko ime '{0}' je već zauzeto.

# EmailNotSend
source: An error occurred while seending mail.
sl: Prišlo je do napake pri pošiljanju e-pošte.
sr_cyrl_rs: Дошло је до грешке при слању мејла.
sr_latn_rs: Došlo je do greške prilikom slanja pošte.

# EmailRequired
source: Email is required.
sl: E-poštni naslov je potreben.
sr_cyrl_rs: Мејл је неопходан.
sr_latn_rs: Mejl je neophodan.

# EntityWasNotFound
source: Entity "{0}" by ({1}) was not found.
sl: Entiteta "{0}" po ({1}) ni bila najdena.
sr_cyrl_rs: Ентитет "{0}" по ({1}) није пронађен.
sr_latn_rs: Entitet "{0}" po ({1}) nije pronađen.

source: Forbidden
sl: Dostop prepovedan.
sr_cyrl_rs: Забрана приступа.
sr_latn_rs: Zabrana pristupa.

# GroupNameRequired
source: Group name is required.
sl: Ime skupine je potrebno.
sr_cyrl_rs: Naziv grupe je neophodan.
sr_latn_rs: Naziv grupe je neophodan.

source: Incorrect username or password.
sl: Napačno uporabniško ime ali geslo.
sr_cyrl_rs: Погрешно корисничко име или лозинка.
sr_latn_rs: Pogrešno korisničko ime ili lozinka.

# InernalServerError
source: Server side error, please contact the administrator.
sl: Napaka na strežniški strani, prosimo kontaktirajte administratorja.
sr_cyrl_rs: Грешка на серверској страни, молим контактирајте администратора.
sr_latn_rs: Greška na serverskoj strani, molim kontaktirajte administratora.

# InvalidEmail
source: Email '{0}' is invalid.
sl: E-poštni naslov '{0}' ni veljaven.
sr_cyrl_rs: Мејл '{0}' је неважећи.
sr_latn_rs: Mejl '{0}' je nevažeći.

# EmailTooLong
source: Email cannot exceed {0} characters.
sl: E-poštni naslov ne sme biti daljši od {0} znakov.
sr_cyrl_rs: Мејл не може бити дужи од {0} карактера.

# InvalidRefreshToken
source: Refresh token is not valid.
sl: Osvežitveni žeton ni veljaven.
sr_cyrl_rs: Токен за освежавање није важећи.
sr_latn_rs: Token za osvježavanje nije važeći.

# InvalidRoleName
source: Role name '{0}' is invalid.
sl: Ime vloge '{0}' ni veljavno.
sr_cyrl_rs: Назив улоге '{0}' је неважећи.
sr_latn_rs: Naziv uloge '{0}' je nevažeći.

# RoleRequired
source: Role is required.
sl: Vloga je obvezna.
sr_cyrl_rs: Улога је обавезна.

# InvalidRole
source: Role '{0}' is invalid.
sl: Vloga '{0}' ni veljavna.
sr_cyrl_rs: Улога '{0}' није важећа.

source: Invalid token.
sl: Neveljaven žeton.
sr_cyrl_rs: Неважећи токен.
sr_latn_rs: Nevažeći token.

# InvalidUserName
source: User name '{0}' is invalid, can only contain letters or digits.
sl: Uporabniško ime '{0}' ni veljavno, lahko vsebuje samo črke ali številke.
sr_cyrl_rs: Корисничко име '{0}' је неважеће, може садржати само слова или цифре.
sr_latn_rs: Korisničko ime '{0}' je nevažeće, može sadržavati samo slova ili cifre.

# LoginAlreadyAssociated
source: A user with this login already exists.
sl: Uporabnik s to prijavo že obstaja.
sr_cyrl_rs: Корисник са овом пријавом већ постоји.
sr_latn_rs: Korisnik sa ovom prijavom već postoji.

# MessageYourselfValidation
source: You cannot send meesage to yourself.
sl: Ne morete si poslati sporočila.
sr_cyrl_rs: Не можете сами себи себи послати поруку.
sr_latn_rs: Ne možete sami sebi poslati poruku.

source: Model can not be null.
sl: Model ne more biti prazen.
sr_cyrl_rs: Модел не може бити непостојећи.
sr_latn_rs: Model ne može biti nepostojeći.

# NewPasswordMustContain
source: A new password must contain uppercase and lowercase letters, numbers, and special characters.
sl: Novo geslo mora vsebovati velike in male črke, številke in posebne znake.
sr_cyrl_rs: Нова лозинка мора садржати велика и мала слова, бројеве и специјалне знакове.
sr_latn_rs: Nova lozinka mora sadržati velika i mala slova, brojeve i specijalne znakоve.

# NewPasswordRequired
source: New password is required.
sl: Novo geslo je potrebno.
sr_cyrl_rs: Нова лозинка је неопходна.
sr_latn_rs: Nova lozinka je neophodna.

# PasswordMismatch
source: Passwords mismatch.
sl: Gesli se ne ujemata.
sr_cyrl_rs: Неподударање лозинки.
sr_latn_rs: Nepodudaranje lozinki.

# PasswordMustContain
source: The password must contain uppercase and lowercase letters, numbers, and special characters.
sl: Geslo mora vsebovati velike in male črke, številke in posebne znake.
sr_cyrl_rs: Лозинка мора садржати велика и мала слова, бројеве и специјалне знакове.
sr_latn_rs: Lozinka mora sadržati velika i mala slova, brojeve i specijalne znakоve.

# PasswordRequired
source: Password is required.
sl: Geslo je potrebno.
sr_cyrl_rs: Лозинка је неопходна.
sr_latn_rs: Lozinka je neophodna.

# PasswordRequiresDigit
source: Passwords must have at least one digit ('0'-'9').
sl: Gesla morajo imeti vsaj eno številko ('0'-'9').
sr_cyrl_rs: Лозинке морају имати најмање једну цифру ('0'-'9').
sr_latn_rs: Lozinke moraju imati najmanje jednu cifru ('0'-'9').

# PasswordRequiresLower
source: Passwords must have at least one lowercase ('a'-'z').
sl: Gesla morajo imeti vsaj eno malo črko ('a'-'z').
sr_cyrl_rs: Лозинке морају имати најмање једно мало слово ('а'-'з').
sr_latn_rs: Lozinke moraju imati najmanje jedno malo slovo ('a'-'z').

# PasswordRequiresNonAlphanumeric
source: Passwords must have at least one non alphanumeric character.
sl: Gesla morajo imeti vsaj en znak, ki ni alfanumeričen.
sr_cyrl_rs: Лозинке морају имати најмање један знак који није алфанумерички.
sr_latn_rs: Lozinke moraju imati najmanje jedan znak koji nije alfanumerički.

# PasswordRequiresUpper
source: Passwords must have at least one uppercase ('A'-'Z').
sl: Gesla morajo imeti vsaj eno veliko črko ('A'-'Z').
sr_cyrl_rs: Лозинке морају имати најмање једно велико слово ('А'-'З').
sr_latn_rs: Lozinke moraju imati najmanje jedno veliko slovo ('A'-'Z').

# PasswordTooShort
source: Passwords must be at least {0} characters.
sl: Gesla morajo imeti vsaj {0} znakov.
sr_cyrl_rs: Лозинке морају имати најманје {0} знакова.
sr_latn_rs: Lozinke moraju imati najmanje {0} znakova.

# PhoneNumberTooLong
source: Phone number cannot exceed {0} characters.
sl: Telefonska številka ne sme biti daljša od {0} znakov.
sr_cyrl_rs: Број телефона не може бити дужи од {0} карактера.

# InvalidPhoneNumber
source: Phone number '{0}' is invalid.
sl: Telefonska številka '{0}' ni veljavna.
sr_cyrl_rs: Број телефона '{0}' није важећи.

# RefreshTokenRequired
source: Refresh token is required.
sl: Osvežitveni žeton je potreben.
sr_cyrl_rs: Токен за освежавање је неопходан.

# TokenRequired
source: Token is required.
sl: Žeton je potreben.
sr_cyrl_rs: Токен је неопходан.
sr_latn_rs: Token je neophodan.

source: Unauthorised
sl: Nimate dovoljenja za dostop.
sr_cyrl_rs: Немате право приступа.
sr_latn_rs: Nemate pravo pristupa.

# UserAlreadyHasPassword
source: User already has a password set.
sl: Uporabnik že ima nastavljeno geslo.
sr_cyrl_rs: Корисник већ има поставлјену лозинку.
sr_latn_rs: Korisnik već ima postavljenu lozinku.

# UserAlreadyInRole
source: User already in role '{0}'.
sl: Uporabnik že ima vlogo '{0}'.
sr_cyrl_rs: Корисник већ има улогу '{0}'.
sr_latn_rs: Korisnik već ima ulogu '{0}'.

# UserExists
source: A user with given username or email already exists, please enter another username or email.
sl: Uporabnik z danim uporabniškim imenom ali e-poštnim naslovom že obstaja, prosimo vnesite drugo uporabniško ime ali e-poštni naslov.
sr_cyrl_rs: Корисник са датим корисничким именом или мејлом већ постоји, унесите друго корисничко име или мејл.
sr_latn_rs: Korisnik sa datim korisničkim imenom već postoji, molimo unesite drugo korisničko ime.

# UserLockoutNotEnabled
source: Lockout is not enabled for this user.
sl: Zaklepanje ni omogočeno za tega uporabnika.
sr_cyrl_rs: Закључавање није омогућено за овог корисника.
sr_latn_rs: Zaključavanje nije omogućeno za ovog korisnika.

# UsernameRequired
source: Username is required.
sl: Uporabniško ime je potrebno.
sr_cyrl_rs: Корисничко име је неопходно.
sr_latn_rs: Korisničko ime je neophodno.

# UserNotInRole
source: User is not in role '{0}'.
sl: Uporabnik ni v vlogi '{0}'.
sr_cyrl_rs: Косрисник није у улоги '{0}'.
sr_latn_rs: Korisnik nije u ulozi '{0}'.

# FirstNameRequired
source: First name is required.
sl: Ime je potrebno.
sr_cyrl_rs: Име је неопходно.

# LastNameRequired
source: Last name is required.
sl: Priimek je potreben.
sr_cyrl_rs: Презиме је неопходно.

# FirstNameTooLong
source: First name must be at most {0} characters long.
sl: Ime mora biti največ {0} znakov dolgo.
sr_cyrl_rs: Име мора бити највише {0} знакова дугачко.

# LastNameTooLong
source: Last name must be at most {0} characters long.
sl: Priimek mora biti največ {0} znakov dolg.
sr_cyrl_rs: Презиме мора бити највише {0} знакова дугачко.

# UserNameTooLong
source: Username must be at most {0} characters long.
sl: Uporabniško ime mora biti največ {0} znakov dolgo.
sr_cyrl_rs: Корисничко име мора бити највише {0} знакова дугачко.

# LanguageIdValid
source: Language ID must be greater than 0.
sl: ID jezika mora biti večji od 0.
sr_cyrl_rs: ID језика мора бити већи од 0.
